{"pageProps":{"markdoc":{"content":[{"$$mdtype":"Tag","name":"p","attributes":{},"children":["As with many great things in life, Git began with a bit of creative destruction and fiery controversy."]},{"$$mdtype":"Tag","name":"p","attributes":{},"children":["The Linux kernel is an open source software project of fairly large scope."," ","During the early years of the Linux kernel maintenance (1991–2002), changes to the software were passed around as patches and archived files."," ","In 2002, the Linux kernel project began using a proprietary DVCS called BitKeeper."]},{"$$mdtype":"Tag","name":"p","attributes":{},"children":["In 2005, the relationship between the community that developed the Linux kernel and the commercial company that developed BitKeeper broke down, and the tool's free-of-charge status was revoked."," ","This prompted the Linux development community (and in particular Linus Torvalds, the creator of Linux) to develop their own tool based on some of the lessons they learned while using BitKeeper.(((Linus Torvalds)))"," ","Some of the goals of the new system were as follows:"]},{"$$mdtype":"Tag","name":"ul","attributes":{},"children":[{"$$mdtype":"Tag","name":"li","attributes":{},"children":["Speed"]},{"$$mdtype":"Tag","name":"li","attributes":{},"children":["Simple design"]},{"$$mdtype":"Tag","name":"li","attributes":{},"children":["Strong support for non-linear development (thousands of parallel branches)"]},{"$$mdtype":"Tag","name":"li","attributes":{},"children":["Fully distributed"]},{"$$mdtype":"Tag","name":"li","attributes":{},"children":["Able to handle large projects like the Linux kernel efficiently (speed and data size)"]}]},{"$$mdtype":"Tag","name":"p","attributes":{},"children":["Since its birth in 2005, Git has evolved and matured to be easy to use and yet retain these initial qualities."," ","It's amazingly fast, it's very efficient with large projects, and it has an incredible branching system for non-linear development."]}],"frontmatter":{"title":"A Short History of Git","description":"What is \"`version control`\", and why should you care?"},"file":{"path":"/docs/history.md"}}},"__N_SSG":true}